In [1]:
import pandas as pd
import numpy as np

In [2]:
dict = {
    "Col1": [1, 2, np.nan, 4, 5],
    "Col2": [6, np.nan, 8, np.nan, 10],
    "Col3": [11, 12, 13, 14, None]
}

In [4]:
df = pd.DataFrame(dict)
df

   Col1  Col2  Col3
0   1.0   6.0  11.0
1   2.0   NaN  12.0
2   NaN   8.0  13.0
3   4.0   NaN  14.0
4   5.0  10.0   NaN

In [5]:
df.isnull()

    Col1   Col2   Col3
0  False  False  False
1  False   True  False
2   True  False  False
3  False   True  False
4  False  False   True

In [6]:
df.isnull()*1

   Col1  Col2  Col3
0     0     0     0
1     0     1     0
2     1     0     0
3     0     1     0
4     0     0     1

In [7]:
df.fillna("Missing")

      Col1     Col2     Col3
0      1.0      6.0     11.0
1      2.0  Missing     12.0
2  Missing      8.0     13.0
3      4.0  Missing     14.0
4      5.0     10.0  Missing

In [8]:
df.interpolate()

   Col1  Col2  Col3
0   1.0   6.0  11.0
1   2.0   7.0  12.0
2   3.0   8.0  13.0
3   4.0   9.0  14.0
4   5.0  10.0  14.0

In [9]:
df.dropna()

   Col1  Col2  Col3
0   1.0   6.0  11.0